olikraus/u8g2/sys/arm/stm32l031x6/si9986_scope/main.c
  while( adcIsSubDone() == 0 )
    adcExecSub();

  ADC1->CHSELR = 1<<ch; 				/* Select channel (can be done also if ADC is enabled) */

  /* DO CONVERSION */

  while( adcStartSubTask(ADC_SUB_TASK_CONVERSION) == 0 )
    adcExecSub();
  
  while( adcIsSubDone() == 0 )
    adcExecSub();
  
  return adc_result;
}

/*
  Channel1:
    Read from ADC1->DR
    Write to buffer
    
  Channel2:
    Read from GPIOA->ODR (PA1) or GPIOB->ODR (PB1)
    Write to buffer

*/

void scanADC(uint8_t ch, uint16_t cnt, uint8_t *buf)
{
  
  stopADC();
  disableADC();
  
  
  RCC->AHBENR |= RCC_AHBENR_DMAEN; /* enable DMA clock */
  __NOP(); __NOP();                                           /* extra delay for clock stabilization required? */

  
  /* disable and reset to defaults */
  DMA1_Channel1->CCR = 0;
  
  /* defaults: 
      - 8 Bit access	--> ok
      - read from peripheral	--> ok
      - none-circular mode  --> ok
      - no increment mode   --> will be changed below
  */
  
  
  DMA1_Channel1->CNDTR = cnt;                                        /* buffer size */
  DMA1_Channel1->CPAR = (uint32_t)&(ADC1->DR);                     /* source value */
  //  DMA1_Channel1->CPAR = (uint32_t)&(GPIOA->ODR);                    /* source value */
  DMA1_Channel1->CMAR = (uint32_t)buf;                   /* destination memory */

  DMA1_CSELR->CSELR &= ~DMA_CSELR_C1S;         /* 0000: select ADC for DMA CH 1 (this is reset default) */
  DMA1_CSELR->CSELR &= ~DMA_CSELR_C2S;         /* 0000: select ADC for DMA CH 2 (this is reset default) */
  
  DMA1_Channel1->CCR |= DMA_CCR_MINC;		/* increment memory */   
  DMA1_Channel1->CCR |= DMA_CCR_EN;                /* enable */

  
  /* 
    detect rising edge on external trigger (ADC_CFGR1_EXTEN_0)
    recive trigger from TIM2 (ADC_CFGR1_EXTSEL_1)  
    8 Bit resolution (ADC_CFGR1_RES_1)
  
    Use DMA one shot mode and enable DMA (ADC_CFGR1_DMAEN)
    Once DMA is finished, it will disable continues mode (ADC_CFGR1_CONT)
  */
  
  
  ADC1->CFGR1 = 
	ADC_CFGR1_CONT				/* continues mode */
	| ADC_CFGR1_EXTEN_0 	/* rising edge */
	| ADC_CFGR1_EXTSEL_1 			/* TIM2 */
//	| ADC_CFGR1_RES_1				/* 8 Bit resolution, no value means 12 bit */
	| ADC_CFGR1_DMAEN;			/* enable generation of DMA requests */

  //ADC1->SMPR |= ADC_SMPR_SMP_0 | ADC_SMPR_SMP_1 | ADC_SMPR_SMP_2; 
  //ADC1->SMPR = ADC_SMPR_SMP_1 ; 
  //ADC1->SMPR = ADC_SMPR_SMP_0 | ADC_SMPR_SMP_1 ; 
  ADC1->SMPR = ADC_SMPR_SMP_2 ; 
  
  /*
    12.5 + 8.5 = 21 ADC Cycles pre ADC sampling
    4 MHz / 21 cycle / 256 = 744 Hz
  */

  enableADC();
  ADC1->CHSELR = 1<<ch; 				/* Select channel (can be done also if ADC is enabled) */
  
  /* conversion will be started automatically with rising edge of TIM2, yet ADSTART is still required */

  ADC1->CR |= ADC_CR_ADSTART; /* start the ADC conversion */

  /* wait until DMA is completed */
  while ( DMA1_Channel1->CNDTR > 0 )
    ;
  
}

/*
  special values:
    -1		Can not find level
    255	no rotation
    0..254	BMEF level, speed is k*(255-getBEMFLevel())
*/
int getBEMFLevel(uint16_t cnt, uint8_t *buf, uint16_t start)
{
  return -1;
}

//#define TIM_CYCLE_TIME 5355
#define TIM_CYCLE_TIME 7950
#define TIM_CYCLE_UPPER_SKIP 100
#define TIM_CYCLE_LOWER_SKIP 400


/*=======================================================================*/

void initTIM(uint16_t tim_cycle, uint8_t is_gpio_a)
{
  /* enable clock for TIM2 */
  RCC->APB1ENR |= RCC_APB1ENR_TIM2EN;
  
  /*enable clock for GPIOA */
  RCC->IOPENR |= RCC_IOPENR_IOPAEN;		/* Enable clock for GPIO Port A */
  RCC->IOPENR |= RCC_IOPENR_IOPBEN;		/* Enable clock for GPIO Port B */
  
    __NOP();                                                          /* extra delay for clock stabilization required? */
    __NOP();
  
  /* prescalar for AHB and APB1 */
  
  /* reselt defaults for HPRE and PPRE1: no clock division */
  // RCC->CFGR &= ~RCC_CFGR_HPRE;
  // RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
  // RCC->CFGR &= ~RCC_CFGR_PPRE1;
  // RCC->CFGR |= RCC_CFGR_PPRE1_DIV1;
  
  /* configure GPIOA PA1 for TIM2 */
  GPIOA->MODER &= ~GPIO_MODER_MODE1;	/* clear mode for PA1 */  
  GPIOA->MODER |= GPIO_MODER_MODE1_1;  /* alt fn */
  GPIOA->OTYPER &= ~GPIO_OTYPER_OT_1;    /* push-pull */
  GPIOA->AFR[0] &= ~(15<<4);            /* Clear Alternate Function PA1 */
  GPIOA->AFR[0] |= 2<<4;                   /* AF2 Alternate Function PA1 */

  /* configure GPIOA PB1 for TIM2 */
  GPIOB->MODER &= ~GPIO_MODER_MODE1;	/* clear mode for PB1 */  
  GPIOB->MODER |= GPIO_MODER_MODE1_1;  /* alt fn */
  GPIOB->OTYPER &= ~GPIO_OTYPER_OT_1;    /* push-pull */
  GPIOB->AFR[0] &= ~(15<<4);            /* Clear Alternate Function PB1 */
  GPIOB->AFR[0] |= 5<<4;                   /* AF5 Alternate Function PB1 */

  /* TIM2 configure */
  /* disable all interrupts */
  //TIM2->DIER = 0;             /* 0 is reset default value */
  
  /* clear everything, including the "Update disable" flag, so that updates */
  /* are generated */
  // TIM2->CR1 = 0;             /* 0 is reset default value */
  //TIM2->CR1 |= TIM_CR1_ARPE;  // ARR is not modified so constant update is ok
  /* Update request by manual UG bit setting or slave controller */
  /* both is not required here */
  /* so, update request by couter over/underflow remains */
  //TIM2->CR1 |= TIM_CR1_URS;             /* only udf/ovf generae events */
  
  TIM2->CR2 |= TIM_CR2_MMS_1;		/* Update event for TRGO */
  
  TIM2->ARR = TIM_CYCLE_TIME;                         /* total cycle count */
  TIM2->CCR2 = 1024;                            /* duty cycle for channel 2 (PA1) */
  TIM2->CCR4 = 1024;                            /* duty cycle for channel 4 (PB1) */
  
  //TIM2->CCMR1 &= ~TIM_CCMR1_OC2CE;      /* disable clear output compare 2 **/
  TIM2->CCMR1 |= TIM_CCMR1_OC2M;            /* all 3 bits set: PWM Mode 2 */
  //TIM2->CCMR1 &= ~TIM_CCMR1_OC1M_0;     /* 110: PWM Mode 1 */
  TIM2->CCMR1 |= TIM_CCMR1_OC2PE;            /* preload enable CCR2 is preloaded*/
  // TIM2->CCMR1 &= ~TIM_CCMR1_OC2FE;            /* fast disable (reset default) */
  // TIM2->CCMR1 &= ~TIM_CCMR1_CC2S;               /* configure cc2 as output (this is reset default) */
  //TIM2->EGR  |=  TIM_EGR_CC2G;              /* capture event cc2 */
  TIM2->CCER |= TIM_CCER_CC2P;                     /* polarity 0: normal (reset default) / 1: inverted*/

  TIM2->CCMR2 |= TIM_CCMR2_OC4M;            /* all 3 bits set: PWM Mode 2 */
  TIM2->CCMR2 |= TIM_CCMR2_OC4PE;            /* preload enable CCR2 is preloaded*/
  TIM2->CCER |= TIM_CCER_CC4P;                     /* polarity 0: normal (reset default) / 1: inverted*/
  
  
  
  if ( is_gpio_a )
    TIM2->CCER |= TIM_CCER_CC2E;                     /* set output enable for channel 2 */
  else
    TIM2->CCER |= TIM_CCER_CC4E;                     /* set output enable for channel 4 */
  
  TIM2->PSC = 7;						/* divide by 8 */
  
